20230202173605-math.org
:PROPERTIES:
:ID:       c5aa6621-b4e2-4956-8049-9047d2a49ff0
:END:
#+title: Math
* 概要
数学。
* Memo
* Tasks
* Reference
** [[https://ja.wikipedia.org/wiki/%E5%9B%9B%E5%85%83%E6%95%B0][四元数 - Wikipedia]]
クォータニオン。回転軸（ベクトル）と回転角（スカラー）よりなる４成分で３次元空間の回転を表現する。CGなどでよく使う。
** [[https://ja.wikipedia.org/wiki/MATLAB][MATLAB - Wikipedia]]
数値解析ソフトウェア。
** [[https://ja.wikipedia.org/wiki/%E3%83%88%E3%83%BC%E3%83%A9%E3%82%B9][トーラス - Wikipedia]]
回転面のこと。
** [[https://ja.wikipedia.org/wiki/%E3%83%86%E3%83%B3%E3%82%BD%E3%83%AB][テンソル - Wikipedia]]
#+begin_quote
テンソル（英: tensor, 独: Tensor）とは、線形的な量または線形的な幾何概念を一般化したもので、基底を選べば、多次元の配列として表現できるようなものである。しかし、テンソル自身は、特定の座標系によらないで定まる対象である。個々のテンソルについて、対応する量を記述するのに必要な配列の添字の組の数は、そのテンソルの階数とよばれる。
#+end_quote
* Archives
