20230202173605-math.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Math</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Math</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0d071e5">概要</a></li>
<li><a href="#orgbe4f93c">Memo</a></li>
<li><a href="#orgb945998">Tasks</a></li>
<li><a href="#orga0502fa">Reference</a>
<ul>
<li><a href="#orgbcd8c0b">四元数 - Wikipedia</a></li>
<li><a href="#org5aa4778">MATLAB - Wikipedia</a></li>
<li><a href="#org7538799">トーラス - Wikipedia</a></li>
<li><a href="#org0cc2820">テンソル - Wikipedia</a></li>
</ul>
</li>
<li><a href="#org53d6849">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0d071e5" class="outline-2">
<h2 id="org0d071e5"><a href="#org0d071e5">概要</a></h2>
<div class="outline-text-2" id="text-org0d071e5">
<p>
数学。
</p>
</div>
</div>
<div id="outline-container-orgbe4f93c" class="outline-2">
<h2 id="orgbe4f93c"><a href="#orgbe4f93c">Memo</a></h2>
</div>
<div id="outline-container-orgb945998" class="outline-2">
<h2 id="orgb945998"><a href="#orgb945998">Tasks</a></h2>
</div>
<div id="outline-container-orga0502fa" class="outline-2">
<h2 id="orga0502fa"><a href="#orga0502fa">Reference</a></h2>
<div class="outline-text-2" id="text-orga0502fa">
</div>
<div id="outline-container-orgbcd8c0b" class="outline-3">
<h3 id="orgbcd8c0b"><a href="#orgbcd8c0b"><a href="https://ja.wikipedia.org/wiki/%E5%9B%9B%E5%85%83%E6%95%B0">四元数 - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-orgbcd8c0b">
<p>
クォータニオン。回転軸（ベクトル）と回転角（スカラー）よりなる４成分で３次元空間の回転を表現する。CGなどでよく使う。
</p>
</div>
</div>
<div id="outline-container-org5aa4778" class="outline-3">
<h3 id="org5aa4778"><a href="#org5aa4778"><a href="https://ja.wikipedia.org/wiki/MATLAB">MATLAB - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-org5aa4778">
<p>
数値解析ソフトウェア。
</p>
</div>
</div>
<div id="outline-container-org7538799" class="outline-3">
<h3 id="org7538799"><a href="#org7538799"><a href="https://ja.wikipedia.org/wiki/%E3%83%88%E3%83%BC%E3%83%A9%E3%82%B9">トーラス - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-org7538799">
<p>
回転面のこと。
</p>
</div>
</div>
<div id="outline-container-org0cc2820" class="outline-3">
<h3 id="org0cc2820"><a href="#org0cc2820"><a href="https://ja.wikipedia.org/wiki/%E3%83%86%E3%83%B3%E3%82%BD%E3%83%AB">テンソル - Wikipedia</a></a></h3>
<div class="outline-text-3" id="text-org0cc2820">
<blockquote>
<p>
テンソル（英: tensor, 独: Tensor）とは、線形的な量または線形的な幾何概念を一般化したもので、基底を選べば、多次元の配列として表現できるようなものである。しかし、テンソル自身は、特定の座標系によらないで定まる対象である。個々のテンソルについて、対応する量を記述するのに必要な配列の添字の組の数は、そのテンソルの階数とよばれる。
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org53d6849" class="outline-2">
<h2 id="org53d6849"><a href="#org53d6849">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
